{
  "_name_or_path": "stabilityai/stablelm-2-1_6b",
  "architectures": [
    "StableLmForCausalLM"
  ],
  "attention_dropout": 0.0,
  "bos_token_id": 100257,
  "eos_token_id": 100257,
  "hidden_act": "silu",
  "hidden_dropout": 0.0,
  "hidden_size": 2048,
  "initializer_range": 0.02,
  "intermediate_size": 5632,
  "layer_norm_eps": 1e-05,
  "max_position_embeddings": 4096,
  "model_type": "stablelm",
  "num_attention_heads": 32,
  "num_hidden_layers": 24,
  "num_key_value_heads": 32,
  "partial_rotary_factor": 0.25,
  "qk_layernorm": false,
  "rope_scaling": null,
  "rope_theta": 10000,
  "tie_word_embeddings": false,
  "torch_dtype": "float16",
  "transformers_version": "4.44.2",
  "use_cache": true,
  "use_parallel_residual": false,
  "use_qkv_bias": true,
  "vocab_size": 100352
}
